In [1]:
import pandas as pd

In [2]:
df = pd.read_excel('Date & Discharge .xlsx', names=None, index_col=0)
df.head()

        Date  MeanDailyDischarge(m3/s)
0 1994-01-01                      7.60
1 1994-01-02                      7.54
2 1994-01-03                      7.55
3 1994-01-04                      7.57
4 1994-01-05                      7.52

In [3]:
df.tail()

           Date  MeanDailyDischarge(m3/s)
7861 2021-12-27                     29.28
7862 2021-12-28                     28.42
7863 2021-12-29                     27.92
7864 2021-12-30                     27.36
7865 2021-12-31                     26.49

Create Date from 1994 to 2023

In [4]:
OriginalDate = pd.date_range( start = pd.to_datetime('01/01/1994'), end = pd.to_datetime('31/12/2023'))
df2 = pd.DataFrame(OriginalDate)
df2.columns = ['Date']
df2

C:\Users\MASUD RANA\AppData\Local\Temp\ipykernel_10476\3748061804.py:1: UserWarning: Parsing dates in %d/%m/%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  OriginalDate = pd.date_range( start = pd.to_datetime('01/01/1994'), end = pd.to_datetime('31/12/2023'))

            Date
0     1994-01-01
1     1994-01-02
2     1994-01-03
3     1994-01-04
4     1994-01-05
...          ...
10952 2023-12-27
10953 2023-12-28
10954 2023-12-29
10955 2023-12-30
10956 2023-12-31

[10957 rows x 1 columns]

#Merge

In [5]:
merged_data = pd.merge(df2, df, on='Date', how='outer')
merged_data

            Date  MeanDailyDischarge(m3/s)
0     1994-01-01                      7.60
1     1994-01-02                      7.54
2     1994-01-03                      7.55
3     1994-01-04                      7.57
4     1994-01-05                      7.52
...          ...                       ...
10952 2023-12-27                       NaN
10953 2023-12-28                       NaN
10954 2023-12-29                       NaN
10955 2023-12-30                       NaN
10956 2023-12-31                       NaN

[10957 rows x 2 columns]

In [8]:
merged_data.to_excel('All Date but not all Q data.xlsx')